; ModuleID = 'chown.bc_orig.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.Chown_option = type { i32, i8, %struct.dev_ino*, i8, i8, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [1 x i8] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 54, type: !40, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !17)
!3 = !DIFile(filename: "../../src/chown.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/src")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !6, line: 31, size: 32, elements: !7)
!6 = !DIFile(filename: "../../src/chown-core.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/src")
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "V_high", value: 0)
!9 = !DIEnumerator(name: "V_changes_only", value: 1)
!10 = !DIEnumerator(name: "V_off", value: 2)
!11 = !{!12, !15, !16}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !{!18, !38, !0}
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !20, file: !3, line: 315, type: !26, isLocal: true, isDefinition: true)
!20 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 155, type: !21, isLocal: false, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !25)
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !23, !24}
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!25 = !{}
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !27, line: 7, size: 128, elements: !28)
!27 = !DIFile(filename: "../../lib/dev-ino.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/src")
!28 = !{!29, !35}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !26, file: !27, line: 9, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !31, line: 48, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/src")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !33, line: 136, baseType: !34)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/src")
!34 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !26, file: !27, line: 10, baseType: !36, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !31, line: 60, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !33, line: 133, baseType: !34)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "reference_file", scope: !2, file: !3, line: 41, type: !15, isLocal: true, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 3584, elements: !50)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !43, line: 50, size: 256, elements: !44)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/src")
!44 = !{!45, !46, !47, !49}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !42, file: !43, line: 52, baseType: !12, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !42, file: !43, line: 55, baseType: !23, size: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !42, file: !43, line: 56, baseType: !48, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !42, file: !43, line: 57, baseType: !23, size: 32, offset: 192)
!50 = !{!51}
!51 = !DISubrange(count: 14)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "Version", scope: !54, file: !55, line: 2, type: !12, isLocal: false, isDefinition: true)
!54 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, globals: !56)
!55 = !DIFile(filename: "version.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/src")
!56 = !{!52}
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "program_name", scope: !59, file: !60, line: 33, type: !12, isLocal: false, isDefinition: true)
!59 = distinct !DICompileUnit(language: DW_LANG_C99, file: !60, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !61, globals: !62)
!60 = !DIFile(filename: "../../lib/progname.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!61 = !{!16, !15}
!62 = !{!57}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !65, file: !66, line: 26, type: !68, isLocal: false, isDefinition: true)
!65 = distinct !DICompileUnit(language: DW_LANG_C99, file: !66, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, globals: !67)
!66 = !DIFile(filename: "../../lib/version-etc-fsf.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!67 = !{!63}
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 376, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 47)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "file_name", scope: !73, file: !74, line: 36, type: !12, isLocal: true, isDefinition: true)
!73 = distinct !DICompileUnit(language: DW_LANG_C99, file: !74, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !75, globals: !76)
!74 = !DIFile(filename: "../../lib/closeout.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!75 = !{!12}
!76 = !{!71, !77}
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !73, file: !74, line: 46, type: !79, isLocal: true, isDefinition: true)
!79 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "exit_failure", scope: !82, file: !83, line: 24, type: !85, isLocal: false, isDefinition: true)
!82 = distinct !DICompileUnit(language: DW_LANG_C99, file: !83, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, globals: !84)
!83 = !DIFile(filename: "../../lib/exitfail.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!84 = !{!80}
!85 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !23)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "default_tuning", scope: !88, file: !89, line: 131, type: !94, isLocal: true, isDefinition: true)
!88 = distinct !DICompileUnit(language: DW_LANG_C99, file: !89, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !90, globals: !93)
!89 = !DIFile(filename: "../../lib/hash.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!90 = !{!34, !16, !91}
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !92, line: 62, baseType: !34)
!92 = !DIFile(filename: "/home/ma481/Downloads/LLVM_6.0/lib/clang/6.0.0/include/stddef.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!93 = !{!86}
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !96, line: 57, baseType: !97)
!96 = !DIFile(filename: "../../lib/hash.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !96, line: 45, size: 160, elements: !98)
!98 = !{!99, !101, !102, !103, !104}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !97, file: !96, line: 50, baseType: !100, size: 32)
!100 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !97, file: !96, line: 51, baseType: !100, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !97, file: !96, line: 52, baseType: !100, size: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !97, file: !96, line: 53, baseType: !100, size: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !97, file: !96, line: 54, baseType: !79, size: 8, offset: 128)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !107, file: !108, line: 66, type: !178, isLocal: false, isDefinition: true)
!107 = distinct !DICompileUnit(language: DW_LANG_C99, file: !108, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !109, retainedTypes: !142, globals: !144)
!108 = !DIFile(filename: "../../lib/quotearg.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!109 = !{!110, !122, !127}
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !111, line: 32, size: 32, elements: !112)
!111 = !DIFile(filename: "../../lib/quotearg.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121}
!113 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!114 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!115 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!116 = !DIEnumerator(name: "c_quoting_style", value: 3)
!117 = !DIEnumerator(name: "c_maybe_quoting_style", value: 4)
!118 = !DIEnumerator(name: "escape_quoting_style", value: 5)
!119 = !DIEnumerator(name: "locale_quoting_style", value: 6)
!120 = !DIEnumerator(name: "clocale_quoting_style", value: 7)
!121 = !DIEnumerator(name: "custom_quoting_style", value: 8)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !111, line: 209, size: 32, elements: !123)
!123 = !{!124, !125, !126}
!124 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!125 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!126 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 46, size: 32, elements: !129)
!128 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141}
!130 = !DIEnumerator(name: "_ISupper", value: 256)
!131 = !DIEnumerator(name: "_ISlower", value: 512)
!132 = !DIEnumerator(name: "_ISalpha", value: 1024)
!133 = !DIEnumerator(name: "_ISdigit", value: 2048)
!134 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!135 = !DIEnumerator(name: "_ISspace", value: 8192)
!136 = !DIEnumerator(name: "_ISprint", value: 16384)
!137 = !DIEnumerator(name: "_ISgraph", value: 32768)
!138 = !DIEnumerator(name: "_ISblank", value: 1)
!139 = !DIEnumerator(name: "_IScntrl", value: 2)
!140 = !DIEnumerator(name: "_ISpunct", value: 4)
!141 = !DIEnumerator(name: "_ISalnum", value: 8)
!142 = !{!91, !23, !143, !12}
!143 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!144 = !{!105, !145, !151, !162, !167, !174, !176}
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !107, file: !108, line: 80, type: !147, isLocal: false, isDefinition: true)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 256, elements: !149)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!149 = !{!150}
!150 = !DISubrange(count: 8)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !107, file: !108, line: 93, type: !153, isLocal: true, isDefinition: true)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !108, line: 46, size: 448, elements: !154)
!154 = !{!155, !156, !157, !160, !161}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !153, file: !108, line: 49, baseType: !110, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !153, file: !108, line: 52, baseType: !23, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !153, file: !108, line: 56, baseType: !158, size: 256, offset: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 256, elements: !149)
!159 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !153, file: !108, line: 59, baseType: !12, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !153, file: !108, line: 62, baseType: !12, size: 64, offset: 384)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "slot0", scope: !107, file: !108, line: 686, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 256)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "slotvec", scope: !107, file: !108, line: 689, type: !169, isLocal: true, isDefinition: true)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !108, line: 678, size: 128, elements: !171)
!171 = !{!172, !173}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !170, file: !108, line: 680, baseType: !91, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !170, file: !108, line: 681, baseType: !15, size: 64, offset: 64)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "nslots", scope: !107, file: !108, line: 687, type: !159, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "slotvec0", scope: !107, file: !108, line: 688, type: !170, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 576, elements: !180)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!180 = !{!181}
!181 = !DISubrange(count: 9)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "E_bad_spec", scope: !184, file: !185, line: 108, type: !12, isLocal: true, isDefinition: true)
!184 = distinct !DISubprogram(name: "parse_with_separator", scope: !185, file: !185, line: 102, type: !186, isLocal: true, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false, unit: !196, variables: !25)
!185 = !DIFile(filename: "../../lib/userspec.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!186 = !DISubroutineType(types: !187)
!187 = !{!12, !12, !12, !188, !193, !24, !24}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !190, line: 80, baseType: !191)
!190 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !192, line: 134, baseType: !159)
!192 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !190, line: 65, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !192, line: 135, baseType: !159)
!196 = distinct !DICompileUnit(language: DW_LANG_C99, file: !185, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !197, retainedTypes: !206, globals: !207)
!197 = !{!198}
!198 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !199, line: 26, size: 32, elements: !200)
!199 = !DIFile(filename: "../../lib/xstrtol.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!200 = !{!201, !202, !203, !204, !205}
!201 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!202 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!203 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!204 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!205 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!206 = !{!16, !189, !194, !12}
!207 = !{!208, !210, !182}
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "E_invalid_user", scope: !184, file: !185, line: 106, type: !12, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "E_invalid_group", scope: !184, file: !185, line: 107, type: !12, isLocal: true, isDefinition: true)
!212 = distinct !DICompileUnit(language: DW_LANG_C99, file: !213, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !214, retainedTypes: !228)
!213 = !DIFile(filename: "../../src/chown-core.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/src")
!214 = !{!5, !215, !222}
!215 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RCH_status", file: !213, line: 39, size: 32, elements: !216)
!216 = !{!217, !218, !219, !220, !221}
!217 = !DIEnumerator(name: "RC_ok", value: 2)
!218 = !DIEnumerator(name: "RC_excluded", value: 3)
!219 = !DIEnumerator(name: "RC_inode_changed", value: 4)
!220 = !DIEnumerator(name: "RC_do_ordinary_chown", value: 5)
!221 = !DIEnumerator(name: "RC_error", value: 6)
!222 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !6, line: 23, size: 32, elements: !223)
!223 = !{!224, !225, !226, !227}
!224 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 1)
!225 = !DIEnumerator(name: "CH_SUCCEEDED", value: 2)
!226 = !DIEnumerator(name: "CH_FAILED", value: 3)
!227 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 4)
!228 = !{!229, !231, !16, !12}
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !31, line: 80, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !33, line: 134, baseType: !159)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !31, line: 65, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !33, line: 135, baseType: !159)
!233 = distinct !DICompileUnit(language: DW_LANG_C99, file: !234, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !235, retainedTypes: !239)
!234 = !DIFile(filename: "../../lib/version-etc.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!235 = !{!236}
!236 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !234, line: 41, size: 32, elements: !237)
!237 = !{!238}
!238 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2009)
!239 = !{!12, !16}
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !242)
!241 = !DIFile(filename: "../../lib/basename-lgpl.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!242 = !{!15}
!243 = distinct !DICompileUnit(language: DW_LANG_C99, file: !244, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !245, retainedTypes: !400)
!244 = !DIFile(filename: "../../lib/fts.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!245 = !{!246, !250, !382, !385, !397}
!246 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !244, line: 148, size: 32, elements: !247)
!247 = !{!248, !249}
!248 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!249 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !252, file: !251, line: 54, size: 32, elements: !380)
!251 = !DIFile(filename: "../../lib/fts-cycle.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!252 = distinct !DISubprogram(name: "setup_dir", scope: !251, file: !251, line: 50, type: !253, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false, unit: !243, variables: !25)
!253 = !DISubroutineType(types: !254)
!254 = !{!79, !255}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !257, line: 183, baseType: !258)
!257 = !DIFile(filename: "../../lib/fts_.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !257, line: 68, size: 1024, elements: !259)
!259 = !{!260, !325, !326, !328, !330, !331, !332, !333, !334, !335, !342, !343, !346, !367}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !258, file: !257, line: 69, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !257, line: 185, size: 2112, elements: !263)
!263 = !{!264, !265, !266, !267, !269, !270, !271, !272, !273, !274, !275, !276, !278, !279, !282, !283, !284, !285, !323}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !262, file: !257, line: 186, baseType: !261, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !262, file: !257, line: 187, baseType: !261, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !262, file: !257, line: 188, baseType: !261, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !262, file: !257, line: 189, baseType: !268, size: 64, offset: 192)
!268 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !262, file: !257, line: 190, baseType: !16, size: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !262, file: !257, line: 191, baseType: !15, size: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !262, file: !257, line: 192, baseType: !15, size: 64, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !262, file: !257, line: 193, baseType: !23, size: 32, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !262, file: !257, line: 194, baseType: !23, size: 32, offset: 480)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !262, file: !257, line: 195, baseType: !91, size: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !262, file: !257, line: 197, baseType: !255, size: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !262, file: !257, line: 201, baseType: !277, size: 64, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !92, line: 51, baseType: !268)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !262, file: !257, line: 203, baseType: !91, size: 64, offset: 704)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !262, file: !257, line: 204, baseType: !280, size: 64, offset: 768)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !190, line: 75, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !192, line: 139, baseType: !34)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !262, file: !257, line: 220, baseType: !143, size: 16, offset: 832)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !262, file: !257, line: 224, baseType: !143, size: 16, offset: 848)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !262, file: !257, line: 230, baseType: !143, size: 16, offset: 864)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !262, file: !257, line: 232, baseType: !286, size: 1152, offset: 896)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 1152, elements: !321)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !288, line: 46, size: 1152, elements: !289)
!288 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!289 = !{!290, !292, !294, !295, !297, !298, !299, !300, !301, !303, !305, !307, !315, !316, !317}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !287, file: !288, line: 48, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !192, line: 133, baseType: !34)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !287, file: !288, line: 53, baseType: !293, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !192, line: 136, baseType: !34)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !287, file: !288, line: 61, baseType: !281, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !287, file: !288, line: 62, baseType: !296, size: 32, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !192, line: 138, baseType: !159)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !287, file: !288, line: 64, baseType: !191, size: 32, offset: 224)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !287, file: !288, line: 65, baseType: !195, size: 32, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !287, file: !288, line: 67, baseType: !23, size: 32, offset: 288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !287, file: !288, line: 69, baseType: !291, size: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !287, file: !288, line: 74, baseType: !302, size: 64, offset: 384)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !192, line: 140, baseType: !268)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !287, file: !288, line: 78, baseType: !304, size: 64, offset: 448)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !192, line: 162, baseType: !268)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !287, file: !288, line: 80, baseType: !306, size: 64, offset: 512)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !192, line: 167, baseType: !268)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !287, file: !288, line: 91, baseType: !308, size: 128, offset: 576)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !309, line: 8, size: 128, elements: !310)
!309 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!310 = !{!311, !313}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !308, file: !309, line: 10, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !192, line: 148, baseType: !268)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !308, file: !309, line: 11, baseType: !314, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !192, line: 184, baseType: !268)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !287, file: !288, line: 92, baseType: !308, size: 128, offset: 704)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !287, file: !288, line: 93, baseType: !308, size: 128, offset: 832)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !287, file: !288, line: 106, baseType: !318, size: 192, offset: 960)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 192, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 3)
!321 = !{!322}
!322 = !DISubrange(count: 1)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !262, file: !257, line: 233, baseType: !324, size: 8, offset: 2048)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !321)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !258, file: !257, line: 70, baseType: !261, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !258, file: !257, line: 71, baseType: !327, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !258, file: !257, line: 72, baseType: !329, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !190, line: 60, baseType: !291)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !258, file: !257, line: 73, baseType: !15, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !258, file: !257, line: 74, baseType: !23, size: 32, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !258, file: !257, line: 75, baseType: !23, size: 32, offset: 352)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !258, file: !257, line: 77, baseType: !91, size: 64, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !258, file: !257, line: 78, baseType: !91, size: 64, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !258, file: !257, line: 79, baseType: !336, size: 64, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!23, !339, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !258, file: !257, line: 144, baseType: !23, size: 32, offset: 576)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !258, file: !257, line: 154, baseType: !344, size: 64, offset: 640)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !257, line: 154, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !258, file: !257, line: 176, baseType: !347, size: 64, offset: 704)
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !258, file: !257, line: 156, size: 64, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !347, file: !257, line: 169, baseType: !344, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !347, file: !257, line: 175, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !353, line: 28, size: 256, elements: !354)
!353 = !DIFile(filename: "../../lib/cycle-check.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!354 = !{!355, !362, !366}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !352, file: !353, line: 30, baseType: !356, size: 128)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !357, line: 7, size: 128, elements: !358)
!357 = !DIFile(filename: "../../lib/dev-ino.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!358 = !{!359, !361}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !356, file: !357, line: 9, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !190, line: 48, baseType: !293)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !356, file: !357, line: 10, baseType: !329, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !352, file: !353, line: 31, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !364, line: 112, baseType: !365)
!364 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !192, line: 62, baseType: !34)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !352, file: !353, line: 32, baseType: !23, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !258, file: !257, line: 182, baseType: !368, size: 256, offset: 768)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !369, line: 39, baseType: !370)
!369 = !DIFile(filename: "../../lib/i-ring.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !369, line: 31, size: 256, elements: !371)
!371 = !{!372, !376, !377, !378, !379}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !370, file: !369, line: 33, baseType: !373, size: 128)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 128, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 4)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !370, file: !369, line: 34, baseType: !23, size: 32, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !370, file: !369, line: 35, baseType: !159, size: 32, offset: 160)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !370, file: !369, line: 36, baseType: !159, size: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !370, file: !369, line: 37, baseType: !79, size: 8, offset: 224)
!380 = !{!381}
!381 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31)
!382 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !244, line: 732, size: 32, elements: !383)
!383 = !{!384}
!384 = !DIEnumerator(name: "LCO_HT_INITIAL_SIZE", value: 13)
!385 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !386, line: 97, size: 32, elements: !387)
!386 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!387 = !{!388, !389, !390, !391, !392, !393, !394, !395, !396}
!388 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!389 = !DIEnumerator(name: "DT_FIFO", value: 1)
!390 = !DIEnumerator(name: "DT_CHR", value: 2)
!391 = !DIEnumerator(name: "DT_DIR", value: 4)
!392 = !DIEnumerator(name: "DT_BLK", value: 6)
!393 = !DIEnumerator(name: "DT_REG", value: 8)
!394 = !DIEnumerator(name: "DT_LNK", value: 10)
!395 = !DIEnumerator(name: "DT_SOCK", value: 12)
!396 = !DIEnumerator(name: "DT_WHT", value: 14)
!397 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !244, line: 143, size: 32, elements: !398)
!398 = !{!399}
!399 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000)
!400 = !{!16, !363, !15, !268, !401, !406}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!23, !404, !404}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !257, line: 234, baseType: !262)
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !412)
!411 = !DIFile(filename: "../../lib/i-ring.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!412 = !{!413}
!413 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 20, size: 32, elements: !414)
!414 = !{!415}
!415 = !DIEnumerator(name: "I_RING_SIZE", value: 4)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25)
!417 = !DIFile(filename: "../../lib/open-safer.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!418 = distinct !DICompileUnit(language: DW_LANG_C99, file: !419, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25)
!419 = !DIFile(filename: "../../lib/openat-safer.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !421, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25)
!421 = !DIFile(filename: "../../lib/opendir-safer.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !424)
!423 = !DIFile(filename: "../../lib/quote.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!424 = !{!110}
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25)
!426 = !DIFile(filename: "../../lib/root-dev-ino.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!427 = distinct !DICompileUnit(language: DW_LANG_C99, file: !428, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !429)
!428 = !DIFile(filename: "../../lib/umaxtostr.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!429 = !{!363}
!430 = distinct !DICompileUnit(language: DW_LANG_C99, file: !431, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !432, retainedTypes: !441)
!431 = !DIFile(filename: "../../lib/xmalloc.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!432 = !{!433}
!433 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !435, file: !434, line: 207, size: 32, elements: !439)
!434 = !DIFile(filename: "../../lib/xalloc.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!435 = distinct !DISubprogram(name: "x2nrealloc", scope: !434, file: !434, line: 195, type: !436, isLocal: false, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: false, unit: !430, variables: !25)
!436 = !DISubroutineType(types: !437)
!437 = !{!16, !16, !438, !91}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!439 = !{!440}
!440 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 64)
!441 = !{!91, !15}
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !444, retainedTypes: !445)
!443 = !DIFile(filename: "../../lib/xstrtoul.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!444 = !{!198, !127}
!445 = !{!23, !143}
!446 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !448)
!447 = !DIFile(filename: "../../lib/xfts.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!448 = !{!16}
!449 = distinct !DICompileUnit(language: DW_LANG_C99, file: !450, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !75)
!450 = !DIFile(filename: "../../lib/xalloc-die.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!451 = distinct !DICompileUnit(language: DW_LANG_C99, file: !452, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25)
!452 = !DIFile(filename: "../../lib/cloexec.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!453 = distinct !DICompileUnit(language: DW_LANG_C99, file: !454, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25)
!454 = !DIFile(filename: "../../lib/close-stream.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25)
!456 = !DIFile(filename: "../../lib/cycle-check.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!457 = distinct !DICompileUnit(language: DW_LANG_C99, file: !458, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25)
!458 = !DIFile(filename: "../../lib/dup-safer.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25)
!460 = !DIFile(filename: "../../lib/fd-safer.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25)
!462 = !DIFile(filename: "../../lib/fdopendir.c", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/lib")
!463 = !{!"clang version 6.0.0 (tags/RELEASE_600/final)"}
!464 = !{i32 2, !"Dwarf Version", i32 4}
!465 = !{i32 2, !"Debug Info Version", i32 3}
!466 = !{i32 1, !"wchar_size", i32 4}
!467 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 73, type: !468, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false, unit: !2, variables: !25)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !23}
!470 = !DILocalVariable(name: "status", arg: 1, scope: !467, file: !3, line: 73, type: !23)
!471 = !DILocation(line: 73, column: 12, scope: !467)
!472 = !DILocation(line: 75, column: 7, scope: !473)
!473 = distinct !DILexicalBlock(scope: !467, file: !3, line: 75, column: 7)
!474 = !DILocation(line: 75, column: 14, scope: !473)
!475 = !DILocation(line: 75, column: 7, scope: !467)
!476 = !DILocation(line: 76, column: 14, scope: !473)
!477 = !DILocation(line: 77, column: 14, scope: !473)
!478 = !DILocation(line: 76, column: 5, scope: !473)
!479 = !DILocation(line: 84, column: 15, scope: !480)
!480 = distinct !DILexicalBlock(scope: !473, file: !3, line: 79, column: 5)
!481 = !DILocation(line: 84, column: 29, scope: !480)
!482 = !DILocation(line: 80, column: 7, scope: !480)
!483 = !DILocation(line: 85, column: 7, scope: !480)
!484 = !DILocation(line: 93, column: 7, scope: !480)
!485 = !DILocation(line: 98, column: 7, scope: !480)
!486 = !DILocation(line: 105, column: 7, scope: !480)
!487 = !DILocation(line: 109, column: 7, scope: !480)
!488 = !DILocation(line: 117, column: 7, scope: !480)
!489 = !DILocation(line: 129, column: 7, scope: !480)
!490 = !DILocation(line: 130, column: 7, scope: !480)
!491 = !DILocation(line: 131, column: 7, scope: !480)
!492 = !DILocation(line: 144, column: 15, scope: !480)
!493 = !DILocation(line: 144, column: 29, scope: !480)
!494 = !DILocation(line: 144, column: 43, scope: !480)
!495 = !DILocation(line: 137, column: 7, scope: !480)
!496 = !DILocation(line: 145, column: 7, scope: !480)
!497 = !DILocation(line: 147, column: 9, scope: !467)
!498 = !DILocation(line: 147, column: 3, scope: !467)
!499 = !DILocation(line: 148, column: 1, scope: !467)
!500 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !501, file: !501, line: 586, type: !502, isLocal: true, isDefinition: true, scopeLine: 587, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !25)
!501 = !DIFile(filename: "../../src/system.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/src")
!502 = !DISubroutineType(types: !503)
!503 = !{null}
!504 = !DILocation(line: 588, column: 58, scope: !500)
!505 = !DILocation(line: 588, column: 42, scope: !500)
!506 = !DILocation(line: 588, column: 3, scope: !500)
!507 = !DILocation(line: 591, column: 3, scope: !500)
!508 = !DILocation(line: 593, column: 3, scope: !500)
!509 = !DILocalVariable(name: "lc_messages", scope: !500, file: !501, line: 597, type: !12)
!510 = !DILocation(line: 597, column: 15, scope: !500)
!511 = !DILocation(line: 597, column: 29, scope: !500)
!512 = !DILocation(line: 598, column: 7, scope: !513)
!513 = distinct !DILexicalBlock(scope: !500, file: !501, line: 598, column: 7)
!514 = !DILocation(line: 598, column: 19, scope: !513)
!515 = !DILocation(line: 598, column: 31, scope: !513)
!516 = !DILocation(line: 598, column: 22, scope: !513)
!517 = !DILocation(line: 598, column: 7, scope: !500)
!518 = !DILocation(line: 606, column: 33, scope: !519)
!519 = distinct !DILexicalBlock(scope: !513, file: !501, line: 599, column: 5)
!520 = !DILocation(line: 606, column: 17, scope: !519)
!521 = !DILocation(line: 604, column: 7, scope: !519)
!522 = !DILocation(line: 607, column: 5, scope: !519)
!523 = !DILocation(line: 609, column: 66, scope: !500)
!524 = !DILocation(line: 609, column: 50, scope: !500)
!525 = !DILocation(line: 608, column: 3, scope: !500)
!526 = !DILocation(line: 610, column: 1, scope: !500)
!527 = distinct !DISubprogram(name: "klee_dump_memory", scope: !3, file: !3, line: 152, type: !502, isLocal: false, isDefinition: true, scopeLine: 152, isOptimized: false, unit: !2, variables: !25)
!528 = !DILocation(line: 152, column: 26, scope: !527)
!529 = !DILocalVariable(name: "argc", arg: 1, scope: !20, file: !3, line: 155, type: !23)
!530 = !DILocation(line: 155, column: 11, scope: !20)
!531 = !DILocalVariable(name: "argv", arg: 2, scope: !20, file: !3, line: 155, type: !24)
!532 = !DILocation(line: 155, column: 24, scope: !20)
!533 = !DILocalVariable(name: "preserve_root", scope: !20, file: !3, line: 157, type: !79)
!534 = !DILocation(line: 157, column: 8, scope: !20)
!535 = !DILocalVariable(name: "uid", scope: !20, file: !3, line: 159, type: !229)
!536 = !DILocation(line: 159, column: 9, scope: !20)
!537 = !DILocalVariable(name: "gid", scope: !20, file: !3, line: 160, type: !231)
!538 = !DILocation(line: 160, column: 9, scope: !20)
!539 = !DILocalVariable(name: "required_uid", scope: !20, file: !3, line: 164, type: !229)
!540 = !DILocation(line: 164, column: 9, scope: !20)
!541 = !DILocalVariable(name: "required_gid", scope: !20, file: !3, line: 165, type: !231)
!542 = !DILocation(line: 165, column: 9, scope: !20)
!543 = !DILocalVariable(name: "bit_flags", scope: !20, file: !3, line: 168, type: !23)
!544 = !DILocation(line: 168, column: 7, scope: !20)
!545 = !DILocalVariable(name: "dereference", scope: !20, file: !3, line: 172, type: !23)
!546 = !DILocation(line: 172, column: 7, scope: !20)
!547 = !DILocalVariable(name: "chopt", scope: !20, file: !3, line: 174, type: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !6, line: 43, size: 320, elements: !549)
!549 = !{!550, !551, !552, !554, !555, !556, !557}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !548, file: !6, line: 46, baseType: !5, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !548, file: !6, line: 49, baseType: !79, size: 8, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !548, file: !6, line: 53, baseType: !553, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !548, file: !6, line: 56, baseType: !79, size: 8, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "force_silent", scope: !548, file: !6, line: 59, baseType: !79, size: 8, offset: 136)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "user_name", scope: !548, file: !6, line: 62, baseType: !15, size: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !548, file: !6, line: 65, baseType: !15, size: 64, offset: 256)
!558 = !DILocation(line: 174, column: 23, scope: !20)
!559 = !DILocalVariable(name: "ok", scope: !20, file: !3, line: 175, type: !79)
!560 = !DILocation(line: 175, column: 8, scope: !20)
!561 = !DILocalVariable(name: "optc", scope: !20, file: !3, line: 176, type: !23)
!562 = !DILocation(line: 176, column: 7, scope: !20)
!563 = !DILocation(line: 179, column: 21, scope: !20)
!564 = !DILocation(line: 179, column: 3, scope: !20)
!565 = !DILocation(line: 180, column: 3, scope: !20)
!566 = !DILocation(line: 184, column: 3, scope: !20)
!567 = !DILocation(line: 186, column: 3, scope: !20)
!568 = !DILocation(line: 188, column: 3, scope: !20)
!569 = !DILocation(line: 188, column: 31, scope: !20)
!570 = !DILocation(line: 188, column: 37, scope: !20)
!571 = !DILocation(line: 188, column: 18, scope: !20)
!572 = !DILocation(line: 188, column: 16, scope: !20)
!573 = !DILocation(line: 189, column: 10, scope: !20)
!574 = !DILocation(line: 191, column: 15, scope: !575)
!575 = distinct !DILexicalBlock(scope: !20, file: !3, line: 190, column: 5)
!576 = !DILocation(line: 191, column: 7, scope: !575)
!577 = !DILocation(line: 194, column: 21, scope: !578)
!578 = distinct !DILexicalBlock(scope: !575, file: !3, line: 192, column: 9)
!579 = !DILocation(line: 195, column: 11, scope: !578)
!580 = !DILocation(line: 198, column: 21, scope: !578)
!581 = !DILocation(line: 199, column: 11, scope: !578)
!582 = !DILocation(line: 202, column: 21, scope: !578)
!583 = !DILocation(line: 203, column: 11, scope: !578)
!584 = !DILocation(line: 206, column: 23, scope: !578)
!585 = !DILocation(line: 207, column: 11, scope: !578)
!586 = !DILocation(line: 211, column: 23, scope: !578)
!587 = !DILocation(line: 212, column: 11, scope: !578)
!588 = !DILocation(line: 215, column: 25, scope: !578)
!589 = !DILocation(line: 216, column: 11, scope: !578)
!590 = !DILocation(line: 219, column: 25, scope: !578)
!591 = !DILocation(line: 220, column: 11, scope: !578)
!592 = !DILocation(line: 223, column: 28, scope: !578)
!593 = !DILocation(line: 223, column: 26, scope: !578)
!594 = !DILocation(line: 224, column: 11, scope: !578)
!595 = !DILocalVariable(name: "u_dummy", scope: !596, file: !3, line: 228, type: !15)
!596 = distinct !DILexicalBlock(scope: !578, file: !3, line: 227, column: 11)
!597 = !DILocation(line: 228, column: 19, scope: !596)
!598 = !DILocalVariable(name: "g_dummy", scope: !596, file: !3, line: 228, type: !15)
!599 = !DILocation(line: 228, column: 29, scope: !596)
!600 = !DILocalVariable(name: "e", scope: !596, file: !3, line: 229, type: !12)
!601 = !DILocation(line: 229, column: 25, scope: !596)
!602 = !DILocation(line: 229, column: 46, scope: !596)
!603 = !DILocation(line: 229, column: 29, scope: !596)
!604 = !DILocation(line: 232, column: 17, scope: !605)
!605 = distinct !DILexicalBlock(scope: !596, file: !3, line: 232, column: 17)
!606 = !DILocation(line: 232, column: 17, scope: !596)
!607 = !DILocation(line: 233, column: 49, scope: !605)
!608 = !DILocation(line: 233, column: 59, scope: !605)
!609 = !DILocation(line: 233, column: 52, scope: !605)
!610 = !DILocation(line: 233, column: 15, scope: !605)
!611 = !DILocation(line: 234, column: 13, scope: !596)
!612 = !DILocation(line: 238, column: 17, scope: !578)
!613 = !DILocation(line: 238, column: 25, scope: !578)
!614 = !DILocation(line: 239, column: 11, scope: !578)
!615 = !DILocation(line: 242, column: 17, scope: !578)
!616 = !DILocation(line: 242, column: 27, scope: !578)
!617 = !DILocation(line: 243, column: 11, scope: !578)
!618 = !DILocation(line: 246, column: 17, scope: !578)
!619 = !DILocation(line: 246, column: 30, scope: !578)
!620 = !DILocation(line: 247, column: 11, scope: !578)
!621 = !DILocation(line: 250, column: 17, scope: !578)
!622 = !DILocation(line: 250, column: 27, scope: !578)
!623 = !DILocation(line: 251, column: 11, scope: !578)
!624 = !DILocation(line: 253, column: 9, scope: !578)
!625 = !DILocation(line: 254, column: 9, scope: !578)
!626 = !DILocation(line: 256, column: 11, scope: !578)
!627 = distinct !{!627, !568, !628}
!628 = !DILocation(line: 258, column: 5, scope: !20)
!629 = !DILocation(line: 259, column: 1, scope: !20)
!630 = !DILocation(line: 260, column: 13, scope: !631)
!631 = distinct !DILexicalBlock(scope: !20, file: !3, line: 260, column: 7)
!632 = !DILocation(line: 260, column: 7, scope: !20)
!633 = !DILocation(line: 262, column: 11, scope: !634)
!634 = distinct !DILexicalBlock(scope: !635, file: !3, line: 262, column: 11)
!635 = distinct !DILexicalBlock(scope: !631, file: !3, line: 261, column: 5)
!636 = !DILocation(line: 262, column: 21, scope: !634)
!637 = !DILocation(line: 262, column: 11, scope: !635)
!638 = !DILocation(line: 264, column: 15, scope: !639)
!639 = distinct !DILexicalBlock(scope: !640, file: !3, line: 264, column: 15)
!640 = distinct !DILexicalBlock(scope: !634, file: !3, line: 263, column: 9)
!641 = !DILocation(line: 264, column: 27, scope: !639)
!642 = !DILocation(line: 264, column: 15, scope: !640)
!643 = !DILocation(line: 265, column: 13, scope: !639)
!644 = !DILocation(line: 267, column: 23, scope: !640)
!645 = !DILocation(line: 268, column: 9, scope: !640)
!646 = !DILocation(line: 269, column: 5, scope: !635)
!647 = !DILocation(line: 272, column: 17, scope: !648)
!648 = distinct !DILexicalBlock(scope: !631, file: !3, line: 271, column: 5)
!649 = !DILocation(line: 274, column: 36, scope: !20)
!650 = !DILocation(line: 274, column: 48, scope: !20)
!651 = !DILocation(line: 274, column: 9, scope: !20)
!652 = !DILocation(line: 274, column: 33, scope: !20)
!653 = !DILocation(line: 276, column: 7, scope: !654)
!654 = distinct !DILexicalBlock(scope: !20, file: !3, line: 276, column: 7)
!655 = !DILocation(line: 276, column: 14, scope: !654)
!656 = !DILocation(line: 276, column: 12, scope: !654)
!657 = !DILocation(line: 276, column: 24, scope: !654)
!658 = !DILocation(line: 276, column: 21, scope: !654)
!659 = !DILocation(line: 276, column: 7, scope: !20)
!660 = !DILocation(line: 278, column: 11, scope: !661)
!661 = distinct !DILexicalBlock(scope: !662, file: !3, line: 278, column: 11)
!662 = distinct !DILexicalBlock(scope: !654, file: !3, line: 277, column: 5)
!663 = !DILocation(line: 278, column: 19, scope: !661)
!664 = !DILocation(line: 278, column: 16, scope: !661)
!665 = !DILocation(line: 278, column: 11, scope: !662)
!666 = !DILocation(line: 279, column: 9, scope: !661)
!667 = !DILocation(line: 281, column: 60, scope: !661)
!668 = !DILocation(line: 281, column: 65, scope: !661)
!669 = !DILocation(line: 281, column: 70, scope: !661)
!670 = !DILocation(line: 281, column: 53, scope: !661)
!671 = !DILocation(line: 281, column: 9, scope: !661)
!672 = !DILocation(line: 282, column: 7, scope: !662)
!673 = !DILocation(line: 285, column: 7, scope: !674)
!674 = distinct !DILexicalBlock(scope: !20, file: !3, line: 285, column: 7)
!675 = !DILocation(line: 285, column: 7, scope: !20)
!676 = !DILocalVariable(name: "ref_stats", scope: !677, file: !3, line: 287, type: !678)
!677 = distinct !DILexicalBlock(scope: !674, file: !3, line: 286, column: 5)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !679, line: 46, size: 1152, elements: !680)
!679 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/src")
!680 = !{!681, !682, !683, !685, !687, !688, !689, !690, !691, !693, !695, !697, !705, !706, !707}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !678, file: !679, line: 48, baseType: !37, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !678, file: !679, line: 53, baseType: !32, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !678, file: !679, line: 61, baseType: !684, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !33, line: 139, baseType: !34)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !678, file: !679, line: 62, baseType: !686, size: 32, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !33, line: 138, baseType: !159)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !678, file: !679, line: 64, baseType: !230, size: 32, offset: 224)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !678, file: !679, line: 65, baseType: !232, size: 32, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !678, file: !679, line: 67, baseType: !23, size: 32, offset: 288)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !678, file: !679, line: 69, baseType: !37, size: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !678, file: !679, line: 74, baseType: !692, size: 64, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !33, line: 140, baseType: !268)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !678, file: !679, line: 78, baseType: !694, size: 64, offset: 448)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !33, line: 162, baseType: !268)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !678, file: !679, line: 80, baseType: !696, size: 64, offset: 512)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !33, line: 167, baseType: !268)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !678, file: !679, line: 91, baseType: !698, size: 128, offset: 576)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !699, line: 8, size: 128, elements: !700)
!699 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/src")
!700 = !{!701, !703}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !698, file: !699, line: 10, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !33, line: 148, baseType: !268)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !698, file: !699, line: 11, baseType: !704, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !33, line: 184, baseType: !268)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !678, file: !679, line: 92, baseType: !698, size: 128, offset: 704)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !678, file: !679, line: 93, baseType: !698, size: 128, offset: 832)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !678, file: !679, line: 106, baseType: !708, size: 192, offset: 960)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 192, elements: !319)
!709 = !DILocation(line: 287, column: 19, scope: !677)
!710 = !DILocation(line: 288, column: 17, scope: !711)
!711 = distinct !DILexicalBlock(scope: !677, file: !3, line: 288, column: 11)
!712 = !DILocation(line: 288, column: 11, scope: !711)
!713 = !DILocation(line: 288, column: 11, scope: !677)
!714 = !DILocation(line: 289, column: 30, scope: !711)
!715 = !DILocation(line: 290, column: 23, scope: !711)
!716 = !DILocation(line: 290, column: 16, scope: !711)
!717 = !DILocation(line: 289, column: 9, scope: !711)
!718 = !DILocation(line: 292, column: 23, scope: !677)
!719 = !DILocation(line: 292, column: 11, scope: !677)
!720 = !DILocation(line: 293, column: 23, scope: !677)
!721 = !DILocation(line: 293, column: 11, scope: !677)
!722 = !DILocation(line: 294, column: 48, scope: !677)
!723 = !DILocation(line: 294, column: 25, scope: !677)
!724 = !DILocation(line: 294, column: 13, scope: !677)
!725 = !DILocation(line: 294, column: 23, scope: !677)
!726 = !DILocation(line: 295, column: 49, scope: !677)
!727 = !DILocation(line: 295, column: 26, scope: !677)
!728 = !DILocation(line: 295, column: 13, scope: !677)
!729 = !DILocation(line: 295, column: 24, scope: !677)
!730 = !DILocation(line: 296, column: 5, scope: !677)
!731 = !DILocalVariable(name: "e", scope: !732, file: !3, line: 299, type: !12)
!732 = distinct !DILexicalBlock(scope: !674, file: !3, line: 298, column: 5)
!733 = !DILocation(line: 299, column: 19, scope: !732)
!734 = !DILocation(line: 299, column: 40, scope: !732)
!735 = !DILocation(line: 299, column: 45, scope: !732)
!736 = !DILocation(line: 300, column: 47, scope: !732)
!737 = !DILocation(line: 300, column: 65, scope: !732)
!738 = !DILocation(line: 299, column: 23, scope: !732)
!739 = !DILocation(line: 301, column: 11, scope: !740)
!740 = distinct !DILexicalBlock(scope: !732, file: !3, line: 301, column: 11)
!741 = !DILocation(line: 301, column: 11, scope: !732)
!742 = !DILocation(line: 302, column: 43, scope: !740)
!743 = !DILocation(line: 302, column: 53, scope: !740)
!744 = !DILocation(line: 302, column: 58, scope: !740)
!745 = !DILocation(line: 302, column: 46, scope: !740)
!746 = !DILocation(line: 302, column: 9, scope: !740)
!747 = !DILocation(line: 307, column: 18, scope: !748)
!748 = distinct !DILexicalBlock(scope: !732, file: !3, line: 307, column: 11)
!749 = !DILocation(line: 307, column: 12, scope: !748)
!750 = !DILocation(line: 307, column: 28, scope: !748)
!751 = !DILocation(line: 307, column: 37, scope: !748)
!752 = !DILocation(line: 307, column: 31, scope: !748)
!753 = !DILocation(line: 307, column: 11, scope: !732)
!754 = !DILocation(line: 308, column: 27, scope: !748)
!755 = !DILocation(line: 308, column: 15, scope: !748)
!756 = !DILocation(line: 308, column: 25, scope: !748)
!757 = !DILocation(line: 308, column: 9, scope: !748)
!758 = !DILocation(line: 310, column: 13, scope: !732)
!759 = !DILocation(line: 313, column: 13, scope: !760)
!760 = distinct !DILexicalBlock(scope: !20, file: !3, line: 313, column: 7)
!761 = !DILocation(line: 313, column: 21, scope: !760)
!762 = !DILocation(line: 313, column: 24, scope: !760)
!763 = !DILocation(line: 313, column: 7, scope: !20)
!764 = !DILocation(line: 316, column: 28, scope: !765)
!765 = distinct !DILexicalBlock(scope: !760, file: !3, line: 314, column: 5)
!766 = !DILocation(line: 316, column: 13, scope: !765)
!767 = !DILocation(line: 316, column: 26, scope: !765)
!768 = !DILocation(line: 317, column: 17, scope: !769)
!769 = distinct !DILexicalBlock(scope: !765, file: !3, line: 317, column: 11)
!770 = !DILocation(line: 317, column: 30, scope: !769)
!771 = !DILocation(line: 317, column: 11, scope: !765)
!772 = !DILocation(line: 318, column: 30, scope: !769)
!773 = !DILocation(line: 319, column: 16, scope: !769)
!774 = !DILocation(line: 318, column: 9, scope: !769)
!775 = !DILocation(line: 320, column: 5, scope: !765)
!776 = !DILocation(line: 322, column: 13, scope: !20)
!777 = !DILocation(line: 323, column: 21, scope: !20)
!778 = !DILocation(line: 323, column: 28, scope: !20)
!779 = !DILocation(line: 323, column: 26, scope: !20)
!780 = !DILocation(line: 323, column: 36, scope: !20)
!781 = !DILocation(line: 324, column: 21, scope: !20)
!782 = !DILocation(line: 324, column: 26, scope: !20)
!783 = !DILocation(line: 325, column: 21, scope: !20)
!784 = !DILocation(line: 325, column: 35, scope: !20)
!785 = !DILocation(line: 323, column: 8, scope: !20)
!786 = !DILocation(line: 323, column: 6, scope: !20)
!787 = !DILocation(line: 327, column: 3, scope: !20)
!788 = !DILocation(line: 329, column: 9, scope: !20)
!789 = !DILocation(line: 329, column: 3, scope: !20)
!790 = !DILocation(line: 330, column: 1, scope: !20)
!791 = distinct !DISubprogram(name: "bad_cast", scope: !501, file: !501, line: 623, type: !792, isLocal: true, isDefinition: true, scopeLine: 624, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !25)
!792 = !DISubroutineType(types: !793)
!793 = !{!15, !12}
!794 = !DILocalVariable(name: "s", arg: 1, scope: !791, file: !501, line: 623, type: !12)
!795 = !DILocation(line: 623, column: 23, scope: !791)
!796 = !DILocation(line: 625, column: 19, scope: !791)
!797 = !DILocation(line: 625, column: 3, scope: !791)
!798 = distinct !DISubprogram(name: "chopt_init", scope: !213, file: !213, line: 59, type: !799, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, unit: !212, variables: !25)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !801}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !6, line: 43, size: 320, elements: !803)
!803 = !{!804, !805, !806, !812, !813, !814, !815}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !802, file: !6, line: 46, baseType: !5, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !802, file: !6, line: 49, baseType: !79, size: 8, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !802, file: !6, line: 53, baseType: !807, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !27, line: 7, size: 128, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !808, file: !27, line: 9, baseType: !30, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !808, file: !27, line: 10, baseType: !36, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !802, file: !6, line: 56, baseType: !79, size: 8, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "force_silent", scope: !802, file: !6, line: 59, baseType: !79, size: 8, offset: 136)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "user_name", scope: !802, file: !6, line: 62, baseType: !15, size: 64, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !802, file: !6, line: 65, baseType: !15, size: 64, offset: 256)
!816 = !DILocalVariable(name: "chopt", arg: 1, scope: !798, file: !213, line: 59, type: !801)
!817 = !DILocation(line: 59, column: 34, scope: !798)
!818 = !DILocation(line: 61, column: 3, scope: !798)
!819 = !DILocation(line: 61, column: 10, scope: !798)
!820 = !DILocation(line: 61, column: 20, scope: !798)
!821 = !DILocation(line: 62, column: 3, scope: !798)
!822 = !DILocation(line: 62, column: 10, scope: !798)
!823 = !DILocation(line: 62, column: 23, scope: !798)
!824 = !DILocation(line: 63, column: 3, scope: !798)
!825 = !DILocation(line: 63, column: 10, scope: !798)
!826 = !DILocation(line: 63, column: 34, scope: !798)
!827 = !DILocation(line: 64, column: 3, scope: !798)
!828 = !DILocation(line: 64, column: 10, scope: !798)
!829 = !DILocation(line: 64, column: 18, scope: !798)
!830 = !DILocation(line: 65, column: 3, scope: !798)
!831 = !DILocation(line: 65, column: 10, scope: !798)
!832 = !DILocation(line: 65, column: 23, scope: !798)
!833 = !DILocation(line: 66, column: 3, scope: !798)
!834 = !DILocation(line: 66, column: 10, scope: !798)
!835 = !DILocation(line: 66, column: 20, scope: !798)
!836 = !DILocation(line: 67, column: 3, scope: !798)
!837 = !DILocation(line: 67, column: 10, scope: !798)
!838 = !DILocation(line: 67, column: 21, scope: !798)
!839 = !DILocation(line: 68, column: 1, scope: !798)
!840 = distinct !DISubprogram(name: "chopt_free", scope: !213, file: !213, line: 71, type: !799, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, unit: !212, variables: !25)
!841 = !DILocalVariable(name: "chopt", arg: 1, scope: !840, file: !213, line: 71, type: !801)
!842 = !DILocation(line: 71, column: 34, scope: !840)
!843 = !DILocation(line: 75, column: 1, scope: !840)
!844 = distinct !DISubprogram(name: "gid_to_name", scope: !213, file: !213, line: 82, type: !845, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, unit: !212, variables: !25)
!845 = !DISubroutineType(types: !846)
!846 = !{!15, !231}
!847 = !DILocalVariable(name: "gid", arg: 1, scope: !844, file: !213, line: 82, type: !231)
!848 = !DILocation(line: 82, column: 20, scope: !844)
!849 = !DILocalVariable(name: "buf", scope: !844, file: !213, line: 84, type: !850)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 168, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 21)
!853 = !DILocation(line: 84, column: 8, scope: !844)
!854 = !DILocalVariable(name: "grp", scope: !844, file: !213, line: 85, type: !855)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !857, line: 42, size: 256, elements: !858)
!857 = !DIFile(filename: "/usr/include/grp.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/src")
!858 = !{!859, !860, !861, !862}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !856, file: !857, line: 44, baseType: !15, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !856, file: !857, line: 45, baseType: !15, size: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !856, file: !857, line: 46, baseType: !232, size: 32, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !856, file: !857, line: 47, baseType: !24, size: 64, offset: 192)
!863 = !DILocation(line: 85, column: 17, scope: !844)
!864 = !DILocation(line: 85, column: 33, scope: !844)
!865 = !DILocation(line: 85, column: 23, scope: !844)
!866 = !DILocation(line: 86, column: 19, scope: !844)
!867 = !DILocation(line: 86, column: 25, scope: !844)
!868 = !DILocation(line: 86, column: 30, scope: !844)
!869 = !DILocation(line: 88, column: 32, scope: !844)
!870 = !DILocation(line: 88, column: 37, scope: !844)
!871 = !DILocation(line: 88, column: 21, scope: !844)
!872 = !DILocation(line: 86, column: 10, scope: !844)
!873 = !DILocation(line: 86, column: 3, scope: !844)
!874 = distinct !DISubprogram(name: "uid_to_name", scope: !213, file: !213, line: 96, type: !875, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, unit: !212, variables: !25)
!875 = !DISubroutineType(types: !876)
!876 = !{!15, !229}
!877 = !DILocalVariable(name: "uid", arg: 1, scope: !874, file: !213, line: 96, type: !229)
!878 = !DILocation(line: 96, column: 20, scope: !874)
!879 = !DILocalVariable(name: "buf", scope: !874, file: !213, line: 98, type: !850)
!880 = !DILocation(line: 98, column: 8, scope: !874)
!881 = !DILocalVariable(name: "pwd", scope: !874, file: !213, line: 99, type: !882)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !884, line: 49, size: 384, elements: !885)
!884 = !DIFile(filename: "/usr/include/pwd.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/src")
!885 = !{!886, !887, !888, !889, !890, !891, !892}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !883, file: !884, line: 51, baseType: !15, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !883, file: !884, line: 52, baseType: !15, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !883, file: !884, line: 53, baseType: !230, size: 32, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !883, file: !884, line: 54, baseType: !232, size: 32, offset: 160)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !883, file: !884, line: 55, baseType: !15, size: 64, offset: 192)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !883, file: !884, line: 56, baseType: !15, size: 64, offset: 256)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !883, file: !884, line: 57, baseType: !15, size: 64, offset: 320)
!893 = !DILocation(line: 99, column: 18, scope: !874)
!894 = !DILocation(line: 99, column: 34, scope: !874)
!895 = !DILocation(line: 99, column: 24, scope: !874)
!896 = !DILocation(line: 100, column: 19, scope: !874)
!897 = !DILocation(line: 100, column: 25, scope: !874)
!898 = !DILocation(line: 100, column: 30, scope: !874)
!899 = !DILocation(line: 102, column: 32, scope: !874)
!900 = !DILocation(line: 102, column: 37, scope: !874)
!901 = !DILocation(line: 102, column: 21, scope: !874)
!902 = !DILocation(line: 100, column: 10, scope: !874)
!903 = !DILocation(line: 100, column: 3, scope: !874)
!904 = distinct !DISubprogram(name: "chown_files", scope: !213, file: !213, line: 483, type: !905, isLocal: false, isDefinition: true, scopeLine: 487, flags: DIFlagPrototyped, isOptimized: false, unit: !212, variables: !25)
!905 = !DISubroutineType(types: !906)
!906 = !{!79, !24, !23, !229, !231, !229, !231, !907}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!909 = !DILocalVariable(name: "files", arg: 1, scope: !904, file: !213, line: 483, type: !24)
!910 = !DILocation(line: 483, column: 21, scope: !904)
!911 = !DILocalVariable(name: "bit_flags", arg: 2, scope: !904, file: !213, line: 483, type: !23)
!912 = !DILocation(line: 483, column: 32, scope: !904)
!913 = !DILocalVariable(name: "uid", arg: 3, scope: !904, file: !213, line: 484, type: !229)
!914 = !DILocation(line: 484, column: 20, scope: !904)
!915 = !DILocalVariable(name: "gid", arg: 4, scope: !904, file: !213, line: 484, type: !231)
!916 = !DILocation(line: 484, column: 31, scope: !904)
!917 = !DILocalVariable(name: "required_uid", arg: 5, scope: !904, file: !213, line: 485, type: !229)
!918 = !DILocation(line: 485, column: 20, scope: !904)
!919 = !DILocalVariable(name: "required_gid", arg: 6, scope: !904, file: !213, line: 485, type: !231)
!920 = !DILocation(line: 485, column: 40, scope: !904)
!921 = !DILocalVariable(name: "chopt", arg: 7, scope: !904, file: !213, line: 486, type: !907)
!922 = !DILocation(line: 486, column: 41, scope: !904)
!923 = !DILocalVariable(name: "ok", scope: !904, file: !213, line: 488, type: !79)
!924 = !DILocation(line: 488, column: 8, scope: !904)
!925 = !DILocalVariable(name: "stat_flags", scope: !904, file: !213, line: 491, type: !23)
!926 = !DILocation(line: 491, column: 7, scope: !904)
!927 = !DILocation(line: 491, column: 22, scope: !904)
!928 = !DILocation(line: 491, column: 35, scope: !904)
!929 = !DILocation(line: 491, column: 49, scope: !904)
!930 = !DILocation(line: 491, column: 52, scope: !904)
!931 = !DILocation(line: 491, column: 65, scope: !904)
!932 = !DILocation(line: 492, column: 22, scope: !904)
!933 = !DILocation(line: 492, column: 25, scope: !904)
!934 = !DILocation(line: 492, column: 32, scope: !904)
!935 = !DILocation(line: 493, column: 22, scope: !904)
!936 = !DILocation(line: 493, column: 25, scope: !904)
!937 = !DILocation(line: 493, column: 32, scope: !904)
!938 = !DILocation(line: 493, column: 42, scope: !904)
!939 = !DILocation(line: 491, column: 21, scope: !904)
!940 = !DILocalVariable(name: "fts", scope: !904, file: !213, line: 497, type: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !943, line: 183, baseType: !944)
!943 = !DIFile(filename: "../../lib/fts_.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/src")
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !943, line: 68, size: 1024, elements: !945)
!945 = !{!946, !995, !996, !998, !999, !1000, !1001, !1002, !1003, !1004, !1011, !1012, !1015, !1022}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !944, file: !943, line: 69, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !943, line: 185, size: 2112, elements: !949)
!949 = !{!950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !962, !963, !965, !966, !968, !969, !970, !971, !994}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !948, file: !943, line: 186, baseType: !947, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !948, file: !943, line: 187, baseType: !947, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !948, file: !943, line: 188, baseType: !947, size: 64, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !948, file: !943, line: 189, baseType: !268, size: 64, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !948, file: !943, line: 190, baseType: !16, size: 64, offset: 256)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !948, file: !943, line: 191, baseType: !15, size: 64, offset: 320)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !948, file: !943, line: 192, baseType: !15, size: 64, offset: 384)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !948, file: !943, line: 193, baseType: !23, size: 32, offset: 448)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !948, file: !943, line: 194, baseType: !23, size: 32, offset: 480)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !948, file: !943, line: 195, baseType: !960, size: 64, offset: 512)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !961, line: 62, baseType: !34)
!961 = !DIFile(filename: "/home/ma481/Downloads/LLVM_6.0/lib/clang/6.0.0/include/stddef.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/src")
!962 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !948, file: !943, line: 197, baseType: !941, size: 64, offset: 576)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !948, file: !943, line: 201, baseType: !964, size: 64, offset: 640)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !961, line: 51, baseType: !268)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !948, file: !943, line: 203, baseType: !960, size: 64, offset: 704)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !948, file: !943, line: 204, baseType: !967, size: 64, offset: 768)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !31, line: 75, baseType: !684)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !948, file: !943, line: 220, baseType: !143, size: 16, offset: 832)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !948, file: !943, line: 224, baseType: !143, size: 16, offset: 848)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !948, file: !943, line: 230, baseType: !143, size: 16, offset: 864)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !948, file: !943, line: 232, baseType: !972, size: 1152, offset: 896)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !973, size: 1152, elements: !321)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !679, line: 46, size: 1152, elements: !974)
!974 = !{!975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !991, !992, !993}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !973, file: !679, line: 48, baseType: !37, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !973, file: !679, line: 53, baseType: !32, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !973, file: !679, line: 61, baseType: !684, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !973, file: !679, line: 62, baseType: !686, size: 32, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !973, file: !679, line: 64, baseType: !230, size: 32, offset: 224)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !973, file: !679, line: 65, baseType: !232, size: 32, offset: 256)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !973, file: !679, line: 67, baseType: !23, size: 32, offset: 288)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !973, file: !679, line: 69, baseType: !37, size: 64, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !973, file: !679, line: 74, baseType: !692, size: 64, offset: 384)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !973, file: !679, line: 78, baseType: !694, size: 64, offset: 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !973, file: !679, line: 80, baseType: !696, size: 64, offset: 512)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !973, file: !679, line: 91, baseType: !987, size: 128, offset: 576)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !699, line: 8, size: 128, elements: !988)
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !987, file: !699, line: 10, baseType: !702, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !987, file: !699, line: 11, baseType: !704, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !973, file: !679, line: 92, baseType: !987, size: 128, offset: 704)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !973, file: !679, line: 93, baseType: !987, size: 128, offset: 832)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !973, file: !679, line: 106, baseType: !708, size: 192, offset: 960)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !948, file: !943, line: 233, baseType: !324, size: 8, offset: 2048)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !944, file: !943, line: 70, baseType: !947, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !944, file: !943, line: 71, baseType: !997, size: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !944, file: !943, line: 72, baseType: !36, size: 64, offset: 192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !944, file: !943, line: 73, baseType: !15, size: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !944, file: !943, line: 74, baseType: !23, size: 32, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !944, file: !943, line: 75, baseType: !23, size: 32, offset: 352)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !944, file: !943, line: 77, baseType: !960, size: 64, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !944, file: !943, line: 78, baseType: !960, size: 64, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !944, file: !943, line: 79, baseType: !1005, size: 64, offset: 512)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!23, !1008, !1008}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !944, file: !943, line: 144, baseType: !23, size: 32, offset: 576)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !944, file: !943, line: 154, baseType: !1013, size: 64, offset: 640)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !943, line: 154, flags: DIFlagFwdDecl)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !944, file: !943, line: 176, baseType: !1016, size: 64, offset: 704)
!1016 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !944, file: !943, line: 156, size: 64, elements: !1017)
!1017 = !{!1018, !1019}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !1016, file: !943, line: 169, baseType: !1013, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1016, file: !943, line: 175, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !943, line: 175, flags: DIFlagFwdDecl)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !944, file: !943, line: 182, baseType: !1023, size: 256, offset: 768)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !1024, line: 39, baseType: !1025)
!1024 = !DIFile(filename: "../../lib/i-ring.h", directory: "/home/ma481/Downloads/Chisel/chisel-bench/benchmark/chown-8.2/original/obj-llvm/src")
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !1024, line: 31, size: 256, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030, !1031}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !1025, file: !1024, line: 33, baseType: !373, size: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !1025, file: !1024, line: 34, baseType: !23, size: 32, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !1025, file: !1024, line: 35, baseType: !159, size: 32, offset: 160)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !1025, file: !1024, line: 36, baseType: !159, size: 32, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !1025, file: !1024, line: 37, baseType: !79, size: 8, offset: 224)
!1032 = !DILocation(line: 497, column: 8, scope: !904)
!1033 = !DILocation(line: 497, column: 25, scope: !904)
!1034 = !DILocation(line: 497, column: 32, scope: !904)
!1035 = !DILocation(line: 497, column: 44, scope: !904)
!1036 = !DILocation(line: 497, column: 42, scope: !904)
!1037 = !DILocation(line: 497, column: 14, scope: !904)
!1038 = !DILocation(line: 499, column: 3, scope: !904)
!1039 = !DILocalVariable(name: "ent", scope: !1040, file: !213, line: 501, type: !1041)
!1040 = distinct !DILexicalBlock(scope: !904, file: !213, line: 500, column: 5)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !943, line: 234, baseType: !948)
!1043 = !DILocation(line: 501, column: 15, scope: !1040)
!1044 = !DILocation(line: 503, column: 23, scope: !1040)
!1045 = !DILocation(line: 503, column: 13, scope: !1040)
!1046 = !DILocation(line: 503, column: 11, scope: !1040)
!1047 = !DILocation(line: 504, column: 11, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1040, file: !213, line: 504, column: 11)
!1049 = !DILocation(line: 504, column: 15, scope: !1048)
!1050 = !DILocation(line: 504, column: 11, scope: !1040)
!1051 = !DILocation(line: 506, column: 15, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1053, file: !213, line: 506, column: 15)
!1053 = distinct !DILexicalBlock(scope: !1048, file: !213, line: 505, column: 9)
!1054 = !DILocation(line: 506, column: 21, scope: !1052)
!1055 = !DILocation(line: 506, column: 15, scope: !1053)
!1056 = !DILocation(line: 509, column: 21, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1058, file: !213, line: 509, column: 19)
!1058 = distinct !DILexicalBlock(scope: !1052, file: !213, line: 507, column: 13)
!1059 = !DILocation(line: 509, column: 28, scope: !1057)
!1060 = !DILocation(line: 509, column: 19, scope: !1058)
!1061 = !DILocation(line: 510, column: 27, scope: !1057)
!1062 = !DILocation(line: 510, column: 17, scope: !1057)
!1063 = !DILocation(line: 511, column: 18, scope: !1058)
!1064 = !DILocation(line: 512, column: 13, scope: !1058)
!1065 = !DILocation(line: 513, column: 11, scope: !1053)
!1066 = !DILocation(line: 516, column: 32, scope: !1040)
!1067 = !DILocation(line: 516, column: 37, scope: !1040)
!1068 = !DILocation(line: 516, column: 42, scope: !1040)
!1069 = !DILocation(line: 516, column: 47, scope: !1040)
!1070 = !DILocation(line: 517, column: 32, scope: !1040)
!1071 = !DILocation(line: 517, column: 46, scope: !1040)
!1072 = !DILocation(line: 517, column: 60, scope: !1040)
!1073 = !DILocation(line: 516, column: 13, scope: !1040)
!1074 = !DILocation(line: 516, column: 10, scope: !1040)
!1075 = distinct !{!1075, !1038, !1076}
!1076 = !DILocation(line: 518, column: 5, scope: !904)
!1077 = !DILocation(line: 520, column: 18, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !904, file: !213, line: 520, column: 7)
!1079 = !DILocation(line: 520, column: 7, scope: !1078)
!1080 = !DILocation(line: 520, column: 23, scope: !1078)
!1081 = !DILocation(line: 520, column: 7, scope: !904)
!1082 = !DILocation(line: 522, column: 17, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !1078, file: !213, line: 521, column: 5)
!1084 = !DILocation(line: 522, column: 7, scope: !1083)
!1085 = !DILocation(line: 523, column: 10, scope: !1083)
!1086 = !DILocation(line: 524, column: 5, scope: !1083)
!1087 = !DILocation(line: 526, column: 10, scope: !904)
!1088 = !DILocation(line: 526, column: 3, scope: !904)
!1089 = distinct !DISubprogram(name: "change_file_owner", scope: !213, file: !213, line: 248, type: !1090, isLocal: true, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: false, unit: !212, variables: !25)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!79, !941, !1041, !229, !231, !229, !231, !907}
!1092 = !DILocalVariable(name: "fts", arg: 1, scope: !1089, file: !213, line: 248, type: !941)
!1093 = !DILocation(line: 248, column: 25, scope: !1089)
!1094 = !DILocalVariable(name: "ent", arg: 2, scope: !1089, file: !213, line: 248, type: !1041)
!1095 = !DILocation(line: 248, column: 38, scope: !1089)
!1096 = !DILocalVariable(name: "uid", arg: 3, scope: !1089, file: !213, line: 249, type: !229)
!1097 = !DILocation(line: 249, column: 26, scope: !1089)
!1098 = !DILocalVariable(name: "gid", arg: 4, scope: !1089, file: !213, line: 249, type: !231)
!1099 = !DILocation(line: 249, column: 37, scope: !1089)
!1100 = !DILocalVariable(name: "required_uid", arg: 5, scope: !1089, file: !213, line: 250, type: !229)
!1101 = !DILocation(line: 250, column: 26, scope: !1089)
!1102 = !DILocalVariable(name: "required_gid", arg: 6, scope: !1089, file: !213, line: 250, type: !231)
!1103 = !DILocation(line: 250, column: 46, scope: !1089)
!1104 = !DILocalVariable(name: "chopt", arg: 7, scope: !1089, file: !213, line: 251, type: !907)
!1105 = !DILocation(line: 251, column: 47, scope: !1089)
!1106 = !DILocalVariable(name: "file_full_name", scope: !1089, file: !213, line: 253, type: !12)
!1107 = !DILocation(line: 253, column: 15, scope: !1089)
!1108 = !DILocation(line: 253, column: 32, scope: !1089)
!1109 = !DILocation(line: 253, column: 37, scope: !1089)
!1110 = !DILocalVariable(name: "file", scope: !1089, file: !213, line: 254, type: !12)
!1111 = !DILocation(line: 254, column: 15, scope: !1089)
!1112 = !DILocation(line: 254, column: 22, scope: !1089)
!1113 = !DILocation(line: 254, column: 27, scope: !1089)
!1114 = !DILocalVariable(name: "file_stats", scope: !1089, file: !213, line: 255, type: !1115)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!1117 = !DILocation(line: 255, column: 22, scope: !1089)
!1118 = !DILocalVariable(name: "stat_buf", scope: !1089, file: !213, line: 256, type: !973)
!1119 = !DILocation(line: 256, column: 15, scope: !1089)
!1120 = !DILocalVariable(name: "ok", scope: !1089, file: !213, line: 257, type: !79)
!1121 = !DILocation(line: 257, column: 8, scope: !1089)
!1122 = !DILocalVariable(name: "do_chown", scope: !1089, file: !213, line: 258, type: !79)
!1123 = !DILocation(line: 258, column: 8, scope: !1089)
!1124 = !DILocalVariable(name: "symlink_changed", scope: !1089, file: !213, line: 259, type: !79)
!1125 = !DILocation(line: 259, column: 8, scope: !1089)
!1126 = !DILocation(line: 261, column: 11, scope: !1089)
!1127 = !DILocation(line: 261, column: 16, scope: !1089)
!1128 = !DILocation(line: 261, column: 3, scope: !1089)
!1129 = !DILocation(line: 264, column: 11, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1131, file: !213, line: 264, column: 11)
!1131 = distinct !DILexicalBlock(scope: !1089, file: !213, line: 262, column: 5)
!1132 = !DILocation(line: 264, column: 18, scope: !1130)
!1133 = !DILocation(line: 264, column: 11, scope: !1131)
!1134 = !DILocation(line: 266, column: 15, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1136, file: !213, line: 266, column: 15)
!1136 = distinct !DILexicalBlock(scope: !1130, file: !213, line: 265, column: 9)
!1137 = !DILocation(line: 266, column: 15, scope: !1136)
!1138 = !DILocation(line: 270, column: 15, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1135, file: !213, line: 267, column: 13)
!1140 = distinct !{!1140, !1138, !1138}
!1141 = !DILocation(line: 270, column: 15, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1143, file: !213, line: 270, column: 15)
!1143 = distinct !DILexicalBlock(scope: !1139, file: !213, line: 270, column: 15)
!1144 = !DILocation(line: 270, column: 15, scope: !1143)
!1145 = !DILocation(line: 272, column: 24, scope: !1139)
!1146 = !DILocation(line: 272, column: 29, scope: !1139)
!1147 = !DILocation(line: 272, column: 15, scope: !1139)
!1148 = !DILocation(line: 274, column: 37, scope: !1139)
!1149 = !DILocation(line: 274, column: 27, scope: !1139)
!1150 = !DILocation(line: 274, column: 15, scope: !1139)
!1151 = !DILocation(line: 275, column: 15, scope: !1139)
!1152 = !DILocation(line: 277, column: 11, scope: !1136)
!1153 = !DILocation(line: 279, column: 7, scope: !1131)
!1154 = !DILocation(line: 282, column: 13, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1131, file: !213, line: 282, column: 11)
